<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RegionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $Damascus_regions = ['المزة', 'الميدان', 'الروضة', 'المرج', 'القابون', 'باب شرقي', 'باب توما', 'القدم', 'الزهراء','الدوار السابع', 'السليمانية', 'الفحامة', 'الشاغور', 'الحميدية', 'المزرعة', 'المهاجرين', 'الركن الدين', 'التجارة', 'الحي العربي', 'الشيخ سعد', 'الزبدية', 'دمر', 'القطنا', 'الجرمانا', 'جوبر', 'التضامن', 'السلمانية', 'الجديدة', 'الشامية', 'القنوات', 'الشعفة', 'بارزة', 'الصالحية', 'العدوين', 'الطريق الدائري', 'العباسية', 'التل', 'الحجر الأسود', 'المحمدية', 'النهضة', 'التحرير', 'الشهباء', 'المشروع الصناعي', 'دوما', 'العتمانية','العباسيين','شارع الأمين', 'كفر سوسة', 'بين السرايات', 'الصالحية الغربية', 'الصالحية الشرقية', 'الزاهرة', 'التجمع الأول', 'التجمع الثاني', 'التجمع الثالث', 'التجمع الرابع', 'التجمع الخامس'];
        sort($Damascus_regions);
        foreach($Damascus_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 1;
            Region::create($region);
        }

        $Aleppo_regions = ['جمعية الزهراء', 'الميدان', 'الأعظمية', 'السكري', 'جمعية الرحمة', 'جمعية النور', 'الشعار', 'الحمدانية', 'الشيخ هنادي', 'الأطرش', 'الجميلية', 'الأربعين', 'الزهور', 'الحلبيون', 'المعادي', 'المرجة', 'السكري', 'المساكن الشعبية', 'القبيات', 'الزهراء', 'باب النيرب', 'السكرية الجديدة', 'الشيخ فارس', 'الحمدانية الجديدة', 'الأعمال الصناعية', 'الراموسة', 'السبيل', 'السكري الشمالي', 'الزهور الشمالية', 'المحافظة', 'الشيخ لطفي', 'السكري الجنوبي', 'الجمعية الشرعية', 'الأنصاري', 'حي الجمهورية', 'الشيخ سعد', 'الحمدانية الشرقية', 'المنطقة الصناعية', 'الأعمال الزراعية', 'السويلمية', 'الجمعية العلمية', 'الأعمال الحرفية', 'الجامعة', 'الكلاسة', 'الأعمال التجارية', 'الرحمانية', 'السليمانية', 'الأعمال الصناعية الجديدة', 'الأعمال الحرفية الجديدة', 'الأرض الخضراء', 'الصناعة الثقيلة', 'الكرامة', 'الخالدية', 'السكري الغربي', 'السكري الشرقي', 'الأعمال الزراعية الجديدة', 'الأعمال التجارية الجديدة', 'المساكن الشعبية الجديدة', 'بستان القصر', 'التصنيع الزراعي', 'التصنيع الصناعي', 'حي الزهور', 'الأعمال الخدمية', 'الصالحين', 'السكري الوسطاني', 'التعاون', 'الأعمال الحرفية الوسطانية', 'الأعمال الزراعية الوسطانية', 'الأعمال التجارية الوسطانية', 'الأعمال الصناعية الوسطانية', 'الأعمال الحرفية الغربية', 'الأعمال الزراعية الغربية', 'الأعمال التجارية الغربية', 'الأعمال الصناعية الغربية', 'الصناعات الغذائية', 'الأعمال الحرفية الشرقية', 'الأعمال الزراعية الشرقية', 'الأعمال التجارية الشرقية', 'الأعمال الصناعية الشرقية', 'الشيخ فارس الشرقية', 'الشيخ فارس الغربية', 'الشيخ هنادي الشرقية', 'الشيخ هنادي الغربية'];
        sort($Aleppo_regions);
        foreach($Aleppo_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 2;
            Region::create($region);
        }

        $Rural_Damascus_regions = ['التل', 'النبك', 'يبرود', 'عرنة', 'سقبا', 'الدمير', 'الزبداني', 'القطيفة', 'داريا', 'التل الكبير', 'الحمة', 'الزيب', 'حرستا', 'النشابية', 'حمص الشرقية', 'حمص الغربية', 'الناصرية', 'بلودان', 'الجراجير', 'الكسوة', 'القطنا', 'سرغايا', 'عقربا', 'السيدة زينب', 'الحرية', 'القسيمة', 'التيبة', 'الدمشقية', 'الصنمين', 'النشابية الغربية', 'العتمان', 'المشرفة', 'بيت سحم', 'حرمون', 'حماة', 'دوما', 'العين', 'عين الفيجة', 'السويداء', 'التل الأبيض', 'حمص', 'الحسينية', 'السيدة زينب الجنوبية', 'السيدة زينب الشمالية', 'الجرمانا', 'التلة الخضراء', 'الحمرا', 'المحمدية', 'المرج', 'المشفى', 'المطلة', 'بقين', 'بيت جن', 'تلكلخ', 'جديدة عرطوز', 'داريا البلد', 'ديماس', 'رحيبة', 'زملكا', 'سعنايا', 'صحنايا', 'قطنا', 'كفر بطنا', 'كفربطيخ', 'كفرسوسة', 'مضايا', 'معرة النعمان', 'نبع الفجر', 'نبل', 'نسيب', 'الحسينية الزغرية', 'الحمراء', 'الزبيب', 'الرحية', 'الشفاء', 'المالكية', 'المزة', 'المزرعة', 'المشرفة الغربية', 'المشرفة الشرقية', 'النعمانية', 'بعلبة', 'جرابلس', 'دوار الجمرك', 'دير عطية', 'سوق وادي بردى', 'عين ترما', 'كفر سوسة', 'مسرابا', 'مشروع دمر', 'نهر عيشة', 'الشيخ سعد', 'الشيخ علي', 'الغزالة', 'المحمدية الغربية', 'المحمدية الشرقية', 'المزة الشرقية', 'المزة الغربية', 'المزرعة الغربية', 'المزرعة الشرقية', 'المعلمين', 'الميدان', 'النهضة', 'اليادودة', 'ببيلا', 'بستان الباشا', 'بقرصونا', 'تلبيسة', 'جديدة الشياح', 'جمرايا', 'داريا العامرية', 'دمر', 'دير قانون النهر', 'رنكوس', 'زيزون', 'سبينة', 'سرجة', 'صحراوي', 'صنايا', 'عسال الورد', 'عين الدلب'];
        sort($Rural_Damascus_regions);
        foreach($Rural_Damascus_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 3;
            Region::create($region);
        }

        $Latakia_regions = [ 'الحفة', 'البهلولية', 'القطيلبية', 'بانياس', 'الشيخ بدر', 'صلنفة', 'الشيخ داوود', 'الجديدة', 'المزيرعة', 'الشيخ سعد', 'الدريكيش', 'بقسطا', 'صلمين', 'كسب', 'الشيخ علي', 'المشتى', 'الربيعة', 'الشيخ محمد', 'الشيخ يوسف', 'الغنمية', 'الديمرجي', 'الشيخ خضر', 'الشيخ حسن', 'الحارة الشرقية', 'الحارة الغربية', 'الحارة الوسطى', 'الشيخ ياسين', 'الشيخ خليل', 'الجملية', 'النازحين الفلسطينيين', 'النازحين السوريين', 'النازحين العراقيين'];
        sort($Latakia_regions);
        foreach($Latakia_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 4;
            Region::create($region);
        }

        $Tartous_regions = [ 'الدريكيش', 'بانياس', 'صافيتا', 'الشيخ بدر', 'القدموس', 'الحمامات', 'الشيخ داود', 'المشتى', 'الصفصافة', 'الرميلة', 'الفنار', 'العوامية', 'المشارف', 'العنيزة', 'السويدية', 'القرداحة', 'السمرلي', 'الناقورة', 'الغصنية', 'الرزيقات', 'الرستن', 'الشيخ علي', 'الكفير', 'البهلولية', 'الحلوة', 'المزيرعة', 'الفرحانية', 'القرية البحرية', 'الرمانة', 'السموع', 'العبودية', 'العشارة', 'العمرية', 'الغنمية', 'الكرامة', 'النازحين الفلسطينيين', 'النازحين السوريين', 'النازحين العراقيين'];
        sort($Tartous_regions);
        foreach($Tartous_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 5;
            Region::create($region);
        }

        $Homs_regions = [ 'تلكلخ', 'الحولة', 'المخرم', 'الرستن', 'الغنطوس', 'القريتين', 'مرمريتا', 'حوش العدس', 'تدمر', 'السخنة', 'الشرقي', 'الشين', 'الناصرة', 'الوعر', 'الزعفرانية', 'الحرم', 'القصير', 'العريضة', 'العريضة الجنوبية', 'العريضة الشمالية', 'العريضة الغربية', 'الفريقلس', 'المشتى', 'المخرم الغربي', 'المحمودية', 'المزيرعة', 'المنصورة', 'النزيهة', 'الهول', 'تلبيسة', 'تيرمعل', 'حميمة', 'ربعو', 'ريف حمص', 'شين', 'شين الشمالي', 'صوران', 'ضاحية الأسد', 'عين حلاقيم', 'عين الدنانير', 'عين حور', 'عين الخضراء', 'عين الصفراء', 'عين العرب', 'عين هجرة', 'قلعة الحصن', 'كرناز', 'كفرلحم', 'كفرنبودة', 'كوا', 'مراكز النازحين', 'مرفدة', 'مشمش', 'نهر الضمان'];
        sort($Homs_regions);
        foreach($Homs_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 6;
            Region::create($region);
        }

        $Hama_regions = [ 'السلمية', 'مصياف', 'سلحب', 'قطران', 'عقيربات', 'عين حلاقيم', 'المصدار', 'الغاب', 'مركز الحرجلة', 'الرصافة', 'حوران', 'الحميري', 'الجراجير', 'محردة', 'مصياف الجديدة', 'تلدو', 'الشيخان', 'المخيمات', 'الواعرة', 'ريف حماة', 'محطة ريف حماة', 'مرفد', 'الحميدية', 'العريضة', 'العمارنة', 'الغرابية', 'القنيطرة', 'الكافور', 'الناصرة', 'المحطة', 'المزيرعة', 'المشرفة', 'النورية', 'الأفرين', 'الرفيع', 'الرمانة', 'العين', 'القصير', 'القبيبات', 'المسيفرة', 'باب الطبق', 'بسام', 'جب جنين', 'دركوش', 'دريكش', 'سالمية', 'شلوم', 'شيز', 'صالحية', 'عين الحور', 'عين النسور', 'عين الكروم', 'عين حرش', 'عين حورة', 'عين شريف', 'عين قنية', 'عين ورتان', 'غريان', 'كفرزيتا', 'محلس', 'مليحات', 'نصورة', 'وادي العيون'];
        sort($Hama_regions);
        foreach($Hama_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 7;
            Region::create($region);
        }

        $Deir_el_Zor_regions = [ 'البصيرة', 'الشحيل', 'الحصايا', 'الميادين', 'الصور', 'الكسرة', 'العريشة', 'البومالك', 'الجبيلية', 'الكورية', 'الطبقة', 'البوخمسين', 'الحريجة', 'العريمة', 'المحمودية', 'المنصورة', 'الميادة', 'الهجين', 'الهيشة', 'الوجه الجديد', 'بوقرنة', 'حويجة سكر', 'سبكو', 'عياشة', 'قصر سلمان', 'محطة الربيعي', 'ميسلون', 'هجين'];
        sort($Deir_el_Zor_regions);
        foreach($Deir_el_Zor_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 8;
            Region::create($region);
        }

        $Idlib_regions = ['أريحا', 'جسر الشغور', 'حارم', 'كفرنبل', 'معرة النعمان', 'سراقب', 'معرة حرمة', 'كفر تخاريم', 'حلفايا', 'إبلين', 'جبل الزاوية', 'الدانا', 'بلس', 'كفرسجنة', 'البارة', 'محمبل', 'الجنديرس', 'بنش', 'سلقين', 'كفر لوسين', 'كفريا', 'الفوعة', 'كفرنجة', 'معرسورين', 'كفروما', 'بسقا', 'معرة مصرين', 'حزانو', 'باب الهوى', 'عنجارة', 'كفردلب', 'زرنجة', 'أبو الظهور', 'تلمنس', 'سلمى', 'درقنديل', 'إدلب الجديدة', 'كفر عويد', 'خان شيخون', 'كفر حمرة', 'كفرسوسة', 'قرميد', 'سوجان', 'كفرموس', 'كفر نبل', 'أطمة', 'الغاب', 'الغزيلة', 'المغير', 'بداما', 'بياجوس', 'جديدة الفاعور', 'حارة البصر', 'حسن', 'دركوش', 'رأس العين', 'رام حمدان', 'ربيعة', 'سفوهن', 'سلمى الغربية', 'سلمى الشرقية', 'صان الحجر', 'عقيربات', 'قرية الغربية', 'قرية الشرقية', 'كفرعمة', 'كفربطنا', 'كفرحوم', 'كفرياخور', 'كفرناها', 'كفرنجة', 'كفرنوبل', 'كفريحم', 'كلجبرين', 'كنصفرة', 'مدياة', 'مريان', 'مزنة', 'معرة ترين', 'معرة شورين', 'ناحية جسر الشغور', 'ناحية دركوش', 'ناحية حارم', 'ناحية كفر تخاريم', 'ناحية سلقين', 'ناحية كفرنبل', 'ناحية كفرسجنة', 'ناحية كفروما', 'ناحية كفريا', 'ناحية معرة النعمان', 'ناحية محمبل'];
        sort($Idlib_regions);
        foreach($Idlib_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 9;
            Region::create($region);
        }

        $Al_Suwaydaa_regions = ['شهبا', 'صلخد', 'عقربا', 'عين النعجة', 'الشراه', 'الصورة', 'الدريكيش', 'المشنف', 'المنيزلة', 'النمرة', 'بصرى', 'بلاد', 'جب الجراجير', 'جيمرين', 'داما', 'رحيبة', 'ساقية الجنزوري', 'صلخد الغربي', 'عرجان', 'عين هبسان', 'عين لوزة', 'عين العرب', 'قنوات', 'كفر شمس', 'مركدة', 'نوى', 'وديان العبيد'];
        sort($Al_Suwaydaa_regions);
        foreach($Al_Suwaydaa_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 10;
            Region::create($region);
        }

        $Al_Hasakah_regions = [ 'عامودا', 'القامشلي', 'المالكية', 'تل حميس', 'تل بيدر', 'الدرباسية', 'اليعربية', 'رأس العين', 'مبروكة', 'قامرلي', 'الحولة', 'تل تمر', 'الجوادية', 'أبو راسين', 'تل براك', 'تل حلف', 'أم مدفع', 'عين ديوار'];
        sort($Al_Hasakah_regions);
        foreach($Al_Hasakah_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 11;
            Region::create($region);
        }

        $Daraa_regions = ['الشيخ مسكين', 'الحارة', 'جاسم', 'الحراك', 'الجيزة', 'النعيمة', 'الصنمين', 'الحيمة', 'بصر الحرير', 'تل شهاب', 'إزرع', 'المزيرعة', 'نوى', 'صلخد', 'طفس', 'الشجرة', 'المسيفرة', 'الصورة', 'الجدعية', 'اليادودة', 'الحسينية', 'الحميدية', 'الحنية', 'السهوة', 'الشريعة', 'الصراخ', 'الضميرية', 'الطيبة', 'العدوانية', 'العين', 'الغارية', 'الكرك', 'المحرق', 'المنية', 'الناصرة', 'النميرية', 'المسيفرة الشمالية', 'المشارقة', 'المطارفة', 'النعيمة الشمالية', 'الوضاحية', 'الزيدين', 'بصرى الشام', 'جاسم الشرقي', 'جلين', 'درعا البلد', 'زيزون الغربية', 'سحم الجولان', 'طيبة الامام', 'عتمان', 'عين الطرف', 'عين السودة', 'مزيرعة الجديدة', 'معربا', 'نمرة'];
        sort($Daraa_regions);
        foreach($Daraa_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 12;
            Region::create($region);
        }

        $Al_Quneitra_regions = ['حضر', 'عين الكروم', 'جباتا الخشب', 'خان أرنبة', 'مادبا', 'نبع الصخر', 'البقعة', 'الحارة', 'الحميدية', 'الرفيد', 'الزيدانية', 'الشجرية', 'العزير', 'المشرفة', 'المسيفرة', 'الناصرة', 'الوجيهة', 'بيت جن', 'بيت سحم', 'تل كروم', 'جديدة الشيباني', 'حميمة', 'رقادية', 'شهبا', 'صوريا', 'عين الطلح', 'عين الشهابية', 'عين زيتونة', 'عين قنية', 'عين قنيطرة', 'عين النسور', 'عين الفيجة', 'عين الدب', 'عين البيضا', 'عين البيضا الغربية', 'عين البيضا الشرقية', 'عين البيضا الجنوبية', 'عين الكروم الشمالية', 'عين الكروم الجنوبية', 'عين الكروم الغربية', 'عين الكروم الشرقية', 'عين الكروم المركزية', 'عين الكروم الجديدة', 'عين الكنيسة', 'عين عرب', 'عين طويل', 'عين هبسان', 'عين كنيا', 'عين سلطان', 'عين أبو زيد', 'عين سحاب', 'عين بيت الوتل', 'عين البياضة', 'عين الشهابي', 'عين الصفصاف', 'عين العرب', 'عين الصوابر', 'عين الفرج', 'عين الظهر', 'عين السمين', 'عين القنطرة', 'عين الشميس', 'عين السنوية', 'عين القنب', 'عين الشمران', 'عين القصب', 'عين الجنة', 'عين الدارة', 'عين الخضرا', 'عين الدير', 'عين البيان', 'عين العلق', 'عين القرم', 'عين الكروم الفوقا', 'عين الكروم السفلى', 'عين الكروم الوسطى', 'عين الكروم الشمالية الغربية', 'عين الكروم الجنوبية الغربية', 'عين الكروم الشمالية الشرقية', 'عين الكروم الجنوبية الشرقية', 'عين الكروم الشمالية المركزية', 'عين الكروم الجنوبية المركزية', 'عين الكروم الشمالية المقابلة', 'عين الكروم الجنوبية المقابلة', 'عين الكروم الشمالية المركزية المقابلة', 'عين الكروم الجنوبية المركزية المقابلة'];
        sort($Al_Quneitra_regions);
        foreach($Al_Quneitra_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 13;
            Region::create($region);
        }

        $Al_Raqqa_regions = ['ثوارة', 'تل أبيض', 'المنصورة', 'الثونة الكبرى', 'الكرامة', 'صفصافة', 'الهجين', 'المنصورة الصغرى', 'المشلب', 'حران', 'السبخة', 'الأثرب', 'عين عيسى', 'خنيز', 'العريشة', 'سلخاب', 'المندجة', 'المناخ', 'البعاج', 'الجرنية', 'القصرية', 'الفرحات', 'الكريعات', 'المعبوج', 'المنظرة', 'الهلالية', 'بريدهيب', 'حمام التركمان'];
        sort($Al_Raqqa_regions);
        foreach($Al_Raqqa_regions as $region_name)
        {
            $region['region'] = $region_name;
            $region['city_id'] = 14;
            Region::create($region);
        }
    }
}
